In [1]:
import pandas as pd

# EJERCICIO 1


    1) Crea una lista de nombre "Concursante" que contenga los siguientes valores:
        "Juan", "Pedro", "Andrea", "Luis", "Ana", "Lara", "Jose", "Estefania"

    2) Crea una lista de nombre "Resultados" que contenga los siguientes valores:
        20, 30, 50, 20, 10, 5, 60, 40

    3) Crea un diccionario con los concursantes y los resultados.

    4) Crea un dataframe vacio y apendiza los concursantes y los resultados mediante el empleo de un bucle for

    5) Con ayuda de loc filtra los resultados obtenidos desde Pedro hasta Lara.

    6) Con ayuda de loc filtra los resultados obtenidos mayores o iguales a 40

    7) Muestra el concursante con la mayor puntuación

    8) Muestra el concursante con la menor puntuación

    9) Modifica con la ayuda de loc los valores 20 por 0

    10) Modifica Concursante "Juan" su puntuación por "None" con ayuda de .loc

In [3]:
Concursante = ["Juan", "Pedro", "Andrea", "Luis", "Ana", "Lara", "Jose", "Estefania"]

In [4]:
Resultados = [20, 30, 50, 20, 10, 5, 60, 40]

In [66]:
dicc = {'Concursante': Concursante,'Resultados': Resultados}
print(dicc, type(dicc))

{'Concursante': ['Juan', 'Pedro', 'Andrea', 'Luis', 'Ana', 'Lara', 'Jose', 'Estefania'], 'Resultados': [20, 30, 50, 20, 10, 5, 60, 40]} <class 'dict'>

In [96]:
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [97]:
for i,j in enumerate(dicc.keys()):
    df[j] = dicc[j]
df

  Concursante  Resultados
0        Juan          20
1       Pedro          30
2      Andrea          50
3        Luis          20
4         Ana          10
5        Lara           5
6        Jose          60
7   Estefania          40

In [69]:
df.loc[1:5,:]

  Concursante  Resultados
1       Pedro          30
2      Andrea          50
3        Luis          20
4         Ana          10
5        Lara           5

In [70]:
df.loc[df.Resultados>=40]

  Concursante  Resultados
2      Andrea          50
6        Jose          60
7   Estefania          40

In [71]:
df.Resultados.max()

60

In [72]:
df.loc[df.Resultados==df.Resultados.max()]

  Concursante  Resultados
6        Jose          60

In [73]:
df.loc[df.Resultados==df.Resultados.min()]

  Concursante  Resultados
5        Lara           5

In [74]:
df.loc[df.Resultados==20]

  Concursante  Resultados
0        Juan          20
3        Luis          20

In [80]:
df.Resultados[20] = 0
df

C:\Users\Leandro Vargas\AppData\Local\Temp\ipykernel_14744\976048028.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.Resultados[20] = 0

  Concursante  Resultados
0        Juan           0
1       Pedro          30
2      Andrea          50
3        Luis           0
4         Ana          10
5        Lara           5
6        Jose          60
7   Estefania          40

In [124]:
df_Juan = df.loc[df.Concursante=='Juan']
df_Juan.Resultados = None
df_Juan

C:\Users\Leandro Vargas\AppData\Local\Temp\ipykernel_14744\3936781314.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_Juan.Resultados = None

  Concursante Resultados
0        Juan       None

In [127]:
df.loc[df.Concursante=='Juan','Resultados'] = None

In [128]:
df

  Concursante  Resultados
0        Juan         NaN
1       Pedro        30.0
2      Andrea        50.0
3        Luis        20.0
4         Ana        10.0
5        Lara         5.0
6        Jose        60.0
7   Estefania        40.0

# EJERCICIO 2 (3)

    Escribe un programa que pida dos palabras y diga si riman o no.
    Si coinciden las tres últimas letras tiene que decir que riman.
    Si coinciden sólo las dos últimas tiene que decir que riman un poco y si no, que no riman.

In [160]:
def rima():
    inp1 = input('Riman o no, p1:...')
    inp2 = input('Riman o no, p2:...')
    minimo = min(len(inp1),len(inp2))
    print(minimo)
    n = 0
    
    for i in range(1,minimo):
        print(inp1[-i],inp2[-i])
        if inp1[-i] == inp2[-i]:            
            n += 1
            if n>=3 :
                return 'Las palabras riman'    
            
                
    return 'Las palabras NO riman'

In [159]:
rima()

Riman o no, p1:...hOLA
Riman o no, p2:...HOLA
4
A A
L L
O O

'Las palabras riman'